{
    "jobs": 
    [
       {
          "id":"lhNFgeX5u2v5RlbfAAAAAA==",
          "title":"Web Developer - 1",
          "company":"Akina, Inc.",
          "description":"TS/SCI - Polygraph required\n15-2.8-005Description for Web Developer 1:\nResponsible for designing, creating, testing and maintaining web sites and content that enrich and optimize the exchange of information and produce effective communications between NSA/CSS and its customers. Interact with team to gather and define requirements. Analyze requirements to determine the most effective web technologies to satisfy their needs. Coordinate creation and collection of necessary technology components and integrate them into a coherent site design. Follow a formal design process that includes adhering to laws, standards, and established guidelines for development and delivery of the web site end product. Design and develop visually-pleasing, content rich, user-friendly interfaces with intuitive navigation. Deliver comprehensive web site solutions to satisfy customer requirements. Maintain configuration management.Required Qualifications:\nFour (4) years' experience as a WD in programs and contracts of similar scope, type, and complexity is required.\nBachelor's degree in a technical discipline from an accredited college or university is required.\nFour (4) years of additional WD experience may be substituted for a bachelor's degreeAkina is a Woman Owned, Service Disabled, Veteran Owned, Small Business, looking for talented and ambitious individuals to join our team. We offer a generous compensation package that includes 24 days PTO accrued annually and 11 federal holidays. Our 401k is 100% vested on your start date and the company makes a direct contribution worth 10% of your salary. Akina covers 100% of healthcare costs for employees and 50% toward dependents. We offer educational assistance towards college classes and will cover costs associated with job related training and certificationsAkina is committed to excellence and creating innovative and flexible solutions for our clients. We are a small company with an open ear to our employees' needs in order to attract and retain quality talent that enables our customer's mission.\nwww.akina-inc.com/careers",
          "image":"",
          "location":"Annapolis Junction, MD",
          "employmentType":"Full-time",
          "datePosted":"16 hours ago",
          "salaryRange":"",
          "jobProviders":[
             {
                "jobProvider":"Media Bistro",
                "url":"https://www.mediabistro.com/jobs/576816233-web-developer-1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Ladders",
                "url":"https://www.theladders.com/job/web-developer-1-akinainc-annapolis-junction-md_74757946?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       },
       {
          "id":"xK6f1Q41ZyiTUBLhAAAAAA==",
          "title":"Web Developer - Level Open",
          "company":"University of North Alabama",
          "description":"This position is responsible for the development, maintenance, and management of university websites. Depending upon the level of the successful candidate, this position may be entry-level, mid-level, or senior level.\n\nEntry-level candidates will work under the supervision of senior team members to assist with development, maintenance, and management of university websites while performing web design, coding, and testing tasks to gain hands-on experience and expand their technical skillset.\n\nMid-level candidates will work with a team of marketing and communications professionals to develop, manage, and maintain university websites and environments through the performance of web design, development, deployment, and maintenance activities.\n\nSenior level candidates will oversee the development, management, and enhancement of university web properties. Responsibilities include leading projects, collaborating with key stakeholders, and ensuring that all digital communications align with strategic goals. This position will serve as an expert in web technologies, guiding the implementation of best practices, and driving innovation in digital projects.\n\nFinal title, salary grade, and salary will depend upon the successful candidate’s education and experience. This position is on site. Selected candidates will be required to be on campus. Sponsorship is not available for this position. Entry-Level\n• Assist in designing, creating, modifying, and maintaining university-affiliated websites;\n• Collaborate with senior developers and stakeholders to implement website features and updates;\n• Perform basic coding tasks using HTML, CSS, and JavaScript to enhance user experience;\n• Conduct testing and debugging of web applications across various browsers and devices;\n• Assist in content management system (CMS) tasks, including content updates and minor configuration changes;\n• Provide basic support and training to users on CMS usage and website best practices;\n• Keep up to date regarding basic web development trends and best practices;\n• Perform all other duties as assigned.\nMid-Level\n• Design, create, modify, and maintain university-affiliated websites;\n• Collaborate with stakeholders to create engaging websites, applications, and services for internal and external audiences;\n• Develop, test, and debug web applications in various browsers and devices;\n• Enhance and modify applications, as necessary, to ensure optimal user experiences;\n• Assist in the management of the CMS and serve as an expert resource for key stakeholders;\n• Provide the university community with training on CMS usage and website best practices;\n• Provide customer service to ensure digital content and communication efforts meet university standards;\n• Serve as a source of expertise regarding new and existing web-related projects;\n• Ensure web-based content meets or exceeds accessibility guidelines;\n• Perform all other duties as assigned.\nSenior Level\n• Lead the design, creation, modification, and maintenance of complex university-affiliated websites and applications;\n• Collaborate with leadership and stakeholders to develop and execute digital strategies that meet institutional goals;\n• Oversee the development and testing of web applications, ensuring they are optimized for various browsers and devices;\n• Lead the management and customization of enterprise-level content management systems (CMS), such as Cascade or Omni CMS;\n• Provide advanced training and support to team members and stakeholders on CMS usage and web development best practices;\n• Ensure all web-based content complies with accessibility standards and best practices;\n• Mentor and guide other staff, fostering a collaborative and innovative work environment;\n• Stay ahead of emerging web development trends and technologies, implementing innovative solutions that enhance user experience and site performance;\n• Perform all other duties as assigned.\nADDITIONAL DUTIES:\nEntry-Level\n• Participate in team meetings and contribute ideas for improving web projects;\n• Continuously develop technical skills through training and hands-on experience.\nMid-Level\nMaintain and enhance knowledge of trends, standards, and best practices related to web-based programming languages and online communications.\nSenior Level\n• Drive continuous improvement in web development processes and methodologies.\n• Represent the web development team in cross-departmental meetings and initiatives.\nMINIMUM QUALIFICATIONS:\nEntry-Level\n• High School diploma/equivalent is required;\n• Some related college-level coursework is preferred;\n• Basic knowledge of HTML5, CSS, and JavaScript is required;\n• Familiarity with content management systems (CMS) such as WordPress or similar platforms is preferred;\nMid-Level\n• High School diploma/equivalent is required;\n• Bachelor’s degree in a related field is preferred;\n• Minimum of two years of related work experience is required;\n• Advanced level experience with HTML5 and CSS is required;\n• Working experience of jQuery, JavaScript, PHP, and MySQL is required;\n• Some experience with XML and XSLT is preferred;\n• Experience developing in/for enterprise-level CMS (e.g., Cascade, Omni), preferred;\n• Experience developing in/for WordPress is preferred;\nSenior Level\n• Bachelor’s degree in a related field is required;\n• Master’s degree in a related field or over six years of experience is preferred;\n• Minimum of five years of experience in web development, with a focus on leading digital projects is required;\n• Advanced proficiency in HTML5, CSS, and JavaScript is required;\n• Experience in related technologies is preferred;\n• Extensive experience with CMS, particularly in higher education or enterprise environments, is preferred;\n• Experience mentoring junior developers is required.\n\nKNOWLEDGE, SKILLS, AND ABILITIES:\n• Ability to work both independently and collaboratively as part of a team;\n• Excellent collaborator and communicator;\n• Ability to interact effectively with technical and non-technical users to successfully execute web projects in support of marketing and business development goals;\n• Ability to effectively communicate project status, issues, and resolutions;\n• Fluency in industry best practices, tools, and techniques for site optimization, and the capacity to successfully prioritize and implement improvements;\n• Ability to develop effective and engaging user interfaces and user experiences;\n• Ability to evaluate user behavior and apply insights to develop more user-friendly experiences;\n• Ability to identify and implement process improvements;\nSenior Level\n• Leadership skills;\n• Ability to mentor junior developers.\nApplicants must upload a resume and provide contact information for at least three professional references at the time of application. For questions, please email employment@una.edu or call 256.765.4291 and select option #2.",
          "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQzvZ4rcSDWMCcd08OLha8mbL0W-EP9I8IuxW9S&s=0",
          "location":"Florence, AL",
          "employmentType":"Full-time",
          "datePosted":"",
          "salaryRange":"",
          "jobProviders":[
             {
                "jobProvider":"GovernmentJobs.com",
                "url":"https://www.governmentjobs.com/jobs/4711470-0/web-developer-level-open?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Indeed",
                "url":"https://www.indeed.com/viewjob?jk=83ba6e8b24ffd72e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"SimplyHired",
                "url":"https://www.simplyhired.com/job/GyJ-EHzGwz4K4OcpcG8jL1ei7ijmUkiAyUHtExjmkeMh5AnNcRqzPA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Learn4Good",
                "url":"https://www.learn4good.com/jobs/florence/alabama/info_technology/3739575568/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Adzuna",
                "url":"https://www.adzuna.com/details/4970539153?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Jobcase",
                "url":"https://www.jobcase.com/jobs/view/n/U-116593451815?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Jobilize",
                "url":"https://www.jobilize.com/job/us-al-florence-web-developer-level-open-university-north-alabama-hiring?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       },
       {
          "id":"qX58KRMvKo5OZb5nAAAAAA==",
          "title":"Applications Developer",
          "company":"Central Intelligence Agency",
          "description":"Applications Developers analyze, develop and deploy information/software systems to enhance CIA's capabilities to collect, produce, and disseminate intelligence.",
          "image":"",
          "location":"Washington, DC",
          "employmentType":"Full-time",
          "datePosted":"",
          "salaryRange":"72,965 a year",
          "jobProviders":[
             {
                "jobProvider":"USAJobs",
                "url":"https://www.usajobs.gov/job/759292900?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Indeed",
                "url":"https://www.indeed.com/viewjob?jk=991ba691484278f5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"ZipRecruiter",
                "url":"https://www.ziprecruiter.com/c/Central-Intelligence-Agency/Job/Applications-Developer/-in-Washington,DC?jid=8070fb436be99bd4&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Dice",
                "url":"https://www.dice.com/job-detail/ec005a34-78d1-408d-b88f-10904259df55?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Glassdoor",
                "url":"https://www.glassdoor.com/job-listing/applications-developer-us-central-intelligence-agency-JV_IC1138213_KO0,22_KE23,53.htm?jl=1008966059939&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"LinkedIn",
                "url":"https://www.linkedin.com/jobs/view/applications-developer-at-aevex-aerospace-4001488881?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Washington Post Jobs",
                "url":"https://jobs.washingtonpost.com/job/250753678/applications-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Monster",
                "url":"https://www.monster.com/job-openings/applications-developer-washington-dc--18b375de-c03a-4aa3-8c3b-c176198ab85e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       },
       {
          "id":"-k7e7_k46qy89hubAAAAAA==",
          "title":"Mannapov, LLC is hiring: Senior Web Developer in Boerne",
          "company":"Mannapov LLC",
          "description":"Job Description\n\nJob Description\n\nDescription\n\nPosition Title: Senior Web Developer\n\nClassification: Exempt\n\nReports to: CTO\n\nThe Senior Web Developer will be responsible for developing and maintaining complex web applications, collaborating with cross-functional teams, mentoring junior developers, and develop web applications. This position involves developing scalable web applications, possess a deep understanding of web technologies, and expertise in AWS cloud infrastructure.\n\nEssential Functions\n• Design, develop, and maintain complex web applications using PHP, MySQL, Redis, AJAX, and Laravel.\n• Collaborate with cross-functional teams to ensure that the applications meet business requirements.\n• Develop and maintain AWS infrastructure, including EC2 S3, EDS, and Elastic Beanstalk.\n• Manage projects along the process from planning to deployment, ensuring that deadlines and budget constraints are met.\n• Mentor and coach junior developers, providing guidance and support as needed.\n• Stay up to date with emerging trends in web technologies and bring new ideas and approaches to the team.\n• Troubleshoot and debug applications to ensure optimal performance and user experience.\n• Continuously improve development processes and methodologies to increase efficiency and quality.\n• Develop and maintain documentation for applications, including code comments and technical specifications.\n\nCompetencies\n• Strong knowledge of PHP, MySQL, Redis, AJAX, JAVA, CSS3, Laravel Framework technologies.\n• Expertise in AWS infrastructure, including EC2, S3, RDS, and Elastic Beanstalk.\n• Experience with agile development methodologies and project management tools.\n• Strong analytical and problem-solving skills.\n• Excellent communication and interpersonal skills.\n• Ability to work independently and in a team environment.\n\nRequirements\n\nRequirements\n• Bachelors in computer science, information systems or equivalent experience.\n• A minimum of five (5) years of web development experience.\n• AWS certification such as AWS Certified Solutions Architect or AWS Certified Developer (preferred).\n• Familiarity with containerization technologies such as Docker or Kubernetes (preferred).\n• Experience with version control systems such as Git (preferred).\n• Must be able to read, write and speak English\n\nSupervisory Responsibility\n\nThis position does not manage employees of the department and is not responsible for the performance management and hiring of the employees within that department.\n\nWork Environment\n\nThis job operates in a professional office environment and routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines.\n\nPhysical Demands\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\n\nWhile performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands and fingers and reach with hands and arms.\n\nThis job requires the employee to lift at least 15 lbs. infrequently.\n\nPosition Type/Expected Hours of Work\n\nOccasional evening and weekend work may be required as job duties demand.\n\nTravel\n\nSome out of area travel and overnight may be expected.\n\nWork Authorization\n\nMust be authorized to work in the United States\n\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nMannapov LLC provides equal employment opportunity to all individuals regardless of their race, color, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law. Further, the company takes affirmative action to ensure that applicants are employed and employees are treated during employment without regard to any of these characteristics. Discrimination of any type will not be tolerated.\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.",
          "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcST1knJD2u-WESF94NWsVtnKcjhHY4RKojq65dt&s=0",
          "location":"Boerne, TX",
          "employmentType":"Full-time",
          "datePosted":"1 day ago",
          "salaryRange":"",
          "jobProviders":[
             {
                "jobProvider":"LinkedIn",
                "url":"https://www.linkedin.com/jobs/view/mannapov-llc-is-hiring-senior-web-developer-in-boerne-at-mannapov-llc-4093452639?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Media Bistro",
                "url":"https://www.mediabistro.com/jobs/568149344-mannapov-llc-is-hiring-senior-web-developer-in-boerne?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Adzuna",
                "url":"https://www.adzuna.com/details/4970434696?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       },
       {
          "id":"FtyETR2Whij8G25PAAAAAA==",
          "title":"Web Developer (Remote)",
          "company":"Fusion Technology LLC",
          "description":"Fusion Enterprise Solutions is in search for a Web Developer for a Remote open position.\n• Title: Web Developer\n• Location: Remote\n• Pay: $135,000 - $140,000\n• Benefits: growth opportunity, 401K, insurance package, acquisition of certifications\n• **In search of an entry level and a mid level\n• Entry Level Candidate Pay: $80,000 - $90,000\n\nJob Description:\n\nYou will support the execution of IT management and execution functions across units and systems, to build on the efficiencies gained through centralization over the last several years in order to deliver improved quality, usability and utility. With a requirement to continuously expand, enhance, and maintain enterprise business intelligence, analytical, warehousing, technological, and user support capabilities.\n\nRequirements:\n• Candidate shall have at least 1 years of experience developing with Java or similar software\n• Candidate shall possess experience meeting with system owners to determine requirements for development\n• Candidate shall possess experience collaborating with business analysts and other developers in order to accomplish the team’s goals\n• Candidate shall possess demonstrable knowledge on quickly generating complex code while minimizing the number of bugs\n• Candidate shall possess demonstrable knowledge of unit testing code to identify and fix any bugs\n• Candidate shall possess a demonstrable interest in continuing to build technical skillset\n• Possess a Secret Clearance\n• Experience with Elastic and Kafka is a must\n\nPreferred Qualifications:\n• Prior work experience with the Federal Bureau of Investigation is preferred\n\nPowered by JazzHR\n\nyp4gOVkfvm",
          "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTMXmuCgEKoCLNRC2mWqumvqldTFkIJqo-joHfZ&s=0",
          "location":"United States",
          "employmentType":"Full-time",
          "datePosted":"",
          "salaryRange":"",
          "jobProviders":[
             {
                "jobProvider":"LinkedIn",
                "url":"https://www.linkedin.com/jobs/view/web-developer-remote-at-fusion-technology-llc-4049666769?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       },
       {
          "id":"UECpSJW6L2talK66AAAAAA==",
          "title":"Senior Web Developer",
          "company":"Brown University",
          "description":"Senior Web Developer\n\nBrown University\n\nTo view the full job posting and apply for this position, go to:\nhttps://brown.wd5.myworkdayjobs.com/en-US/staff-careers-brown/job/RT---Rhode-Island/Senior-Web-Developer_REQ195761\n\nJob Description:\n\nSenior Web Developer\n\nOffice of Information Technology\n\nThe Senior Web Developer is responsible for planning, designing,\ncoding, documenting, testing and maintaining custom web\napplications that support Brown's faculty, staff, and students. In\nthis role, the incumbent must facilitate productive relationships\nwith a diverse constituency. As a member of Brown's developer\ncommunity, the senior web developer assists in establishing and\npromoting common development methodologies and tools to ensure all\nlocal systems integrate with the broader campus IT infrastructure.\nThe senior web developer collaborates with the team to promote\nstandardization and efficiencies across the division and to\nmaintain a secure and reliable computing environment aligned with\nOIT's established standards and industry best practices.\n\nJob Qualifications\n• BA/S in Computer Science or related field and 2-3 years of\nrelated technical experience\n• Demonstrated expertise in developing and maintaining\ndatabase-driven web applications with advanced knowledge of various\nrelational database management systems. MySQL strongly\npreferred\n• Demonstrated project management, planning, and process modeling\nskills\n• Proficiency with programming languages related to web\napplication development, including HTML, CSS, PHP, JavaScript,\nNode.js\n• Proficiency with application development frameworks, including\nLaravel, Next.js, Kohana, Codeigniter, etc. Laravel strongly\npreferred\n• Proficiency with frontend development frameworks, including\nReact, Vue. React strongly preferred\n• Strong debugging and problem solving skills\n• A strong curiosity and ability for learning new technologies\n(frameworks, programming languages, methodologies etc)\n• Advanced knowledge of Git\n• Experience with shell scripting\n• OK with being a member of the team's on-call\nrotation\n• Some experience with CMSs. Drupal strongly preferred\n• Some knowledge and practice with devops concepts like building\nCI/CD pipelines, GitHub Actions, creating Docker and Docker Compose\nfiles, and managing apps deployed to a Kubernetes\ncluster\n• Ability to understand non-technical users' requirements in an\nacademic environment, and to generate user-friendly solutions\nquickly within the context of departmental initiatives and division\ngoals\n• Ability to work both independently and as a team member in a\ncomplex environment with competing demands\n• Strong communications skills and the ability to collaborate\nwith non-technical users throughout all phases of project design\nand implementation\n• Possesses a willingness and ability to support a diverse and\ninclusive environment\n\nA cover letter is required for you to be considered for this\nposition.\n\nAll offers are contingent on successful completion of a criminal\nbackground check and education verification.\n\nBenefits of Working at Brown:\n\nInformation on the Benefits of Working at Brown can be found\nhere.\n\nRecruiting Start Date:\n\n2024-05-22\n\nJob Posting Title:\n\nSenior Web Developer\n\nDepartment:\n\nOffice of Information Technology\n\nGrade:\n\nGrade 10\n\nWorker Type:\n\nEmployee\n\nWorker Sub-Type:\n\nRegular\n\nTime Type:\n\nFull time\n\nScheduled Weekly Hours:\n\n37.5\n\nPosition Work Location:\n\nRemote Eligible\n\nSubmission Guidelines:\n\nPlease note that in order to be considered an applicant for any\nstaff position at Brown University you must submit an application\nform for each position for which you believe you are qualified.\nApplications are not kept on file for future positions. Please\ninclude a cover letter and resume with each position\napplication.\n\nStill Have Questions?\n\nIf you have any questions you may contact employment@brown.edu.\n\nEEO Statement:\n\nBrown University is an E-Verify Employer.\n\nAs an EEO/AA\nemployer, Brown University provides equal opportunity and\nprohibits discrimination, harassment and retaliation based upon a\nperson's race, color, religion, sex, age, national or ethnic\norigin, disability, veteran status, sexual orientation, gender\nidentity, gender expression, or any other characteristic protected\nunder applicable law, and caste, which is protected by our\nUniversity policies.\n\njeid-f071cf08d7979a4d98d2c855b30e7018",
          "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRx9IK2s62Y9fCE5U4sU1Fx43ajoUG9ijbLIkfh&s=0",
          "location":"Providence, RI",
          "employmentType":"Full-time",
          "datePosted":"5 days ago",
          "salaryRange":"",
          "jobProviders":[
             {
                "jobProvider":"Chronicle Of Higher Education",
                "url":"https://jobs.chronicle.com/job/37762291/senior-web-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"HigherEdJobs",
                "url":"https://www.higheredjobs.com/admin/details.cfm?JobCode=178958683&Title=Senior+Web+Developer&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Inside Higher Ed Careers",
                "url":"https://careers.insidehighered.com/job/3157927/senior-web-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"LinkedIn",
                "url":"https://www.linkedin.com/jobs/view/senior-web-developer-at-brown-university-3942701444?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Adzuna",
                "url":"https://www.adzuna.com/details/4908298197?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Salary.com",
                "url":"https://www.salary.com/job/ricefw-technologies-inc/web-developer-senior/j202409250049505610420?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Talent.com",
                "url":"https://www.talent.com/view?id=65d0e92525ab&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"JobzMall",
                "url":"https://www.jobzmall.com/brown-university/job/senior-web-developer-9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       },
       {
          "id":"CzEcadLncE3jBbbKAAAAAA==",
          "title":"Web Developer - Computer Engineer **",
          "company":"SimVentions, Inc",
          "description":"Overview:\n\nSimVentions is a 100% employee-owned business and has consistently been voted one of Virginia's Best Places to Work. We are looking for an experienced Web/Software Developer to join our team and provide web/software engineering in an Agile development environment as part of an integrated contractor-government team developing software for tactical weapons systems.\nTravel: Negligible Clearance:\n\nA Secret Clearance is required for this position. Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information. US Citizenship is required to obtain a clearance.\nRequirements:\n• United States Citizenship\n• ACTIVE Secret Clearance\n• At least 8 years of experience writing and delivering software\n• Experience with Object Oriented Languages (C#, Java)\n• Experience using .NET SDKs (at least .NET 6 or newer)\n• Knowledge of Weapon Systems and Command & Control Systems\n\nResponsibilities:\n• Computer Vision Algorithm Development: Strong background in computer vision, with hands-on experience in developing and deploying computer vision algorithms and models in production environments\n• Design, develop, and optimize computer vision algorithms for various applications, including object detection, image segmentation, and image recognition\n• Deep Learning: Apply deep learning techniques, including convolutional neural networks (CNNs) and recurrent neural networks (RNNs), to solve complex computer vision problems\n• Data Collection and Annotation: Oversee data collection efforts and collaborate with teams to annotate and preprocess datasets for computer vision tasks\n• Model Training and Evaluation: Train and fine-tune computer vision models, and establish robust evaluation methodologies to assess their accuracy and performance\n• Integration: Collaborate with software engineers and cross-functional teams to integrate computer vision solutions into products and services\n• Optimization: Optimize computer vision algorithms for real-time and resource-constrained environments\n• Deployment: Deploy computer vision systems into production, ensuring scalability and reliability\n\nPreferred Skills and Experience:\n• Ability to work in a fast paced, rapidly changing range/field environment with a focus on fielding a product\n• Ability to work with others to meet established goals and program schedules\n• Ability to communicate effectively, both verbally and in writing\n\nEducation: A Bachelor of Science (BS) degree from an accredited college or university in an engineering, scientific, or technical discipline is required Compensation:\n\n$95,000 - $140,000 (Please see below for more info on salary)\n\nCompensation at SimVentions is determined by a number of factors, including, but not limited to, the candidate’s experience, education, training, security clearance, work location, skills, knowledge, and competencies, as well as alignment with our corporate compensation plan and contract specific requirements.\n\nThe projected annual compensation range for this position and is just one component of the total compensation package that SimVentions offers.\nBenefits:\n\nAt SimVentions, we’re committed to supporting the total well-being of our employees and their families. Our benefit offerings include comprehensive health and welfare plans to serve a variety of needs.\n\nWe offer:\n• Medical, dental, vision, and prescription drug coverage\n• Employee Stock Ownership Plan (ESOP)\n• Competitive 401(k) programs\n• Retirement and Financial Counselors\n• Health Savings and Health Reimbursement Accounts\n• Flexible Spending Accounts\n• Life insurance, short- & long-term disability\n• Continuing Education Assistance\n• Paid Time Off, Paid Holidays, Paid Leave (e.g., Maternity, Paternity, Jury Duty, Bereavement, Military)\n• Third Party Employee Assistance Program that offers emotional and lifestyle well-being services, to include free counseling\n• Supplemental Benefit Program\n\nWhy Work for SimVentions?:\n\nSimVentions is about more than just being a place to work with other growth-orientated technically exceptional experts. It’s also a fun place to work. Our family-friendly atmosphere encourages our employee-owners to imagine, create, explore, discover, and do great things together.\n\nSupport Our Warfighters\n\nSimVentions is a proud supporter of the U.S. military, and we take pride in our ability to provide relevant, game-changing solutions to our armed men and women around the world.\n\nDrive Customer Success\n\nWe deliver innovative products and solutions that go beyond the expected. This means you can expect to work with a team that will allow you to grow, have a voice, and make an impact.\n\nGet Involved in Giving Back\n\nWe believe a well-rounded company starts with well-rounded employees, which is why we offer diverse service opportunities for our team throughout the year.\n\nBuild Innovative Technology\n\nSimVentions takes pride in its innovative and cutting-edge technology, so you can be sure that whatever project you work on, you will be having a direct impact on our customer’s success.\n\nWork with Brilliant People\n\nWe don’t just hire the smartest people; we seek experienced, creative individuals who are passionate about their work and thrive in our unique culture.\n\nCreate Meaningful Solutions\n\nWe are trusted partners with our customers and are provided challenging and meaningful requirements to help them solve.\n\nEmployees who join SimVentions will enjoy additional perks like:\n• Employee Ownership: Work with the best and help build YOUR company!\n• Family focus: Work for a team that recognizes the importance of family time.\n• Culture: Add to our culture of technical excellence and collaboration.\n• Dress code: Business casual, we like to be comfortable while we work.\n• Resources: Excellent facilities, tools, and training opportunities to grow in your field.\n• Open communication: Work in an environment where your voice matters.\n• Corporate Fellowship: Opportunities to participate in company sports teams and employee-led interest groups for personal and professional development.\n• Employee Appreciation: Multiple corporate events throughout the year, including Holiday Events, Company Picnic, Imagineering Day, and more.\n• Founding Partner of the FredNats Baseball team: Equitable distribution of tickets for every home game to be enjoyed by our employee-owners and their families from our private suite.\n• Food: We have a lot of food around here!",
          "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQg4JN_vlEPqxkYfDJmp_kqyyYeLdjClLhj9IjT&s=0",
          "location":"Dahlgren, VA",
          "employmentType":"Full-time",
          "datePosted":"7 days ago",
          "salaryRange":"95K–140K a year",
          "jobProviders":[
             {
                "jobProvider":"Indeed",
                "url":"https://www.indeed.com/viewjob?jk=7e44f34299e60a85&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Glassdoor",
                "url":"https://www.glassdoor.com/job-listing/web-developer-computer-engineer-simventions-inc-JV_IC1129678_KO0,31_KE32,47.htm?jl=1009552317252&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Simventions, Inc - ICIMS",
                "url":"https://careers-simventions.icims.com/jobs/1339/web-developer---computer-engineer-**/job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Monster",
                "url":"https://www.monster.com/job-openings/web-developer-computer-engineer-dahlgren-va--6640fde9-a603-431a-929c-1f94ebebcfb8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       },
       {
          "id":"y2qBwh-2SfFVfAGPAAAAAA==",
          "title":"Web Developer",
          "company":"Southern Illinois University Edwardsville",
          "description":"Join Our Team!\nThe IRIS Center is looking for a passionate and skilled Web Developer to support exciting digital humanities projects within IRIS and the CODES Program. In this dynamic role, you will contribute to the development, maintenance, and enhancement of applications, platforms, and tools that empower digital scholarship.\n\nWhat You’ll Do:\n• Application Development: Create and maintain applications and platforms that support various digital scholarship initiatives, including back-end customizations for content management systems like WordPress and Omeka S.\n• Platform Maintenance: Conduct regular maintenance on CODES and IRIS platforms, addressing enhancement requests and bug reports to ensure optimal functionality.\n• Consultation and Prototyping: Collaborate with SIUE faculty to explore tools and methods for digital humanities research, developing prototypes to meet their specific project needs.\n• User Testing and Feedback: Engage with students, faculty, and stakeholders through user testing, incorporating their feedback into project development. Create user-friendly documentation for new projects.\n• Sustainable Practices: Develop policies and procedures that promote the sustainability of digital humanities projects, ensuring long-term viability and scalability.\n• Collaboration: Work closely with the Information Technology Services (ITS) team to ensure compliance with university policies regarding security and technical sustainability.\n• Documentation: Maintain comprehensive internal project documentation to support projects at all phases of their lifecycle and write technical content for grant proposals.\n• Stay Current: Keep abreast of changing technology standards, emerging applications, methodologies, and best practices in digital scholarship.\n\nTypical Qualifications\n• *Minimum Qualifications: **\n• Bachelor’s degree in Information Technology, IT Management, Programming, IT system or related field\n• Two (2) years of interface design experience required; equivalent experience considered.\n• *Preferred Qualifications: **\n• Familiarity with digital humanities\n• PHP, MySQL, JavaScript, HTML, CSS, XML, XSLT, Python\n• Familiarity with principles of minimal computing\n• Knowledge of relational database architecture\n• Experience with Bootstrap 5\n• *Knowledge, Skills, and Abilities: **\n• Ability to work collaboratively on a small team\n• Strong writing and verbal communication skills with ability to communicate technical information to a diverse audience\n• Excellent analytical and problem-solving abilities\n• Willingness to learn new technologies and train others\n\nSupplemental Information\n\nCivil Service Information: Civil Service Application - FAQs\n\nApplication Instructions: How to Apply - Step by Step (Download PDF reader)\n\nIllinois Residency Requirement: Pursuant to the State Universities Civil Service System, candidates must be a current Illinois resident.\n• *Classification: **State Universities Civil Service System Classification Number: 5031 – SUCSS Classification Title. For more information on Civil Service classifications, please visit the State Universities Civil Service System website at: https://www.sucss.illinois.gov/pages/classspec/default.aspx.\n• *Veterans: **Veterans who qualify for preference must provide proof of eligibility within ten (10) working days of submitting an application. The required proof of eligibility includes, at a minimum, a copy of the veteran's DD214/DD215 form (Department of Defense), NGB22 form (National Guard), or Discharge Orders or DD256 Discharge Certificate (Reserves). For help in determining the appropriate proof of eligibility to submit, please refer to the Guide for Veteran Document Verification. (Download PDF reader)\n\nPre-Employment Screening: External candidates receiving a job offer must undergo pre-employment screening, including a criminal background check. For safety sensitive positions, a drug screen will also be required.\n\nWork Authorization Information: This position does not offer work authorization sponsorship. International students at SIUE on F-1 or J-1 visas are not eligible for full-time or part-time civil service positions with permanent status. F-1 and J-1 visa holders must be enrolled full-time and can only apply for temporary part-time roles working 20 hours or less per week during spring and fall semesters, such as student worker positions, assistantships, and civil service extra help roles. SIUE is a state university, and it's important to highlight that benefits from state-sponsored plans may not be accessible to individuals on F1 or J1 visas.\n\nAccommodation: If you are unable to utilize our online application system and need to request an accommodation, please reach out to us at 618-650-2190 or via email at: careerinfo@siue.edu\n\nStatement of Diversity: SIUE is an Equal Opportunity Employer committed to an inclusive and diverse workforce. We firmly believe in providing equal access and opportunity to individuals across all job titles. We will not discriminate against any person on the basis of race, national origin, ethnicity, color, religion, disability, age, marital status, sex, sexual orientation or veteran’s status.\n\nSIUE cultivates an atmosphere of inclusivity, respect, and warmth that fosters learning and collaboration. Each member of our university community bears the responsibility of actively contributing to this enriching campus environment. We encourage individuals who are dedicated to upholding these values to apply.\n\nTo learn more about SIUE's Mission and statement on diversity, please visit:https://www.siue.edu/about/mission-goals-plans/index.shtml.\n\nWe value your interest and look forward to reviewing your application. For questions or more information, please email careerinfo@siue.edu.",
          "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTGqeUweH9g0XIwtOTzZgbc6YTlUlHbWDdMlZyP&s=0",
          "location":"Edwardsville, IL",
          "employmentType":"Full-time",
          "datePosted":"",
          "salaryRange":"60K a year",
          "jobProviders":[
             {
                "jobProvider":"Library Jobs Hub",
                "url":"https://libraryjobshub.org/jobs/web-developer-CNc4P3JbsP?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Jobs Trabajo.org",
                "url":"https://us.trabajo.org/job-2402-6f47df3f05452a962df5408437c3f4ae?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Jobilize",
                "url":"https://www.jobilize.com/job/us-il-edwardsville-actimize-lead-developer-system-one-hiring-now-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       },
       {
          "id":"MNevpLyhjyHsa_AOAAAAAA==",
          "title":"Senior Web Developer Job at Mannapov in Boerne",
          "company":"Mannapov LLC",
          "description":"Senior Web Developer. Classification: Exempt. Reports to: CTO - The Senior Web Developer will be responsible for developing and maintaining complex web applications, collaborating with cross-functional teams, mentoring junior developers, and develop Web Developer, Developer, Senior, Application, AWS, Project Management, Technology",
          "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcST1knJD2u-WESF94NWsVtnKcjhHY4RKojq65dt&s=0",
          "location":"Boerne, TX",
          "employmentType":"Full-time",
          "datePosted":"1 day ago",
          "salaryRange":"",
          "jobProviders":[
             {
                "jobProvider":"LinkedIn",
                "url":"https://www.linkedin.com/jobs/view/senior-web-developer-job-at-mannapov-in-boerne-at-mannapov-llc-4093451719?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Media Bistro",
                "url":"https://www.mediabistro.com/jobs/568149312-senior-web-developer-job-at-mannapov-in-boerne?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       },
       {
          "id":"4lyA4OE_iOSTXX2tAAAAAA==",
          "title":"Web Developer Job at Loma Linda University Health in Loma Linda",
          "company":"Loma Linda University Health",
          "description":"Job DescriptionShared Services: Digital Experience- (Full-Time, Day Shift, Hybrid) -Job Summary: The Web Developer is responsible for the development, design and maintenance of major and minor Web applications and components to support LLUH internal and external Web sites. Designs, develops, tests, delivers and maintains web sites, applications and components. Enhancements and defect resolution will be required on an ongoing basis. Best practices and design methods will be utilized to insure the success of the projects. Creates web applications and components from the requirements stage, through design, through production deployment. Performs other duties as needed.Education and Experience: Bachelor's Degree in IT, Business or related field required or an additional five years of experience required in lieu of degree. Minimum three years of experience in web or application development required.Knowledge and Skills: Broad understanding of LLUH Web properties, the content management system tools, and Web analytics tools and technology. Experience in framework design, scripting, programming, as well as development involving compatibility and seamless integration with various technologies. Solid understanding of navigation and GUI for maximizing usability. Able to utilize the following: LAMP Stack CMS applications (i.e., Linux/Apache, MySQL, PHP), as well as Linux command line and server environments, XML, JSON, and responsive design principles. Experience in development of HTML, PHP, vanilla JavaScript, jQuery, CSS, SQL, BootStrap framework. Able to use debugging tools: Firebug, Chrome inspector. Experience with Drupal CMS template and module implementation, acquia Cloud, Blackbaud products (e.g., Raiser-s Edge API), Ellucian Banner, SOLR search is preferred. Able to create pages that can be viewed on any type of browser and/or system including mobile devices; work with browser/server compatibility. Effectively communicate in technical and business environments; demonstrate excellent written and oral communication skills; work in a collaborative, innovative, flexible and team-oriented environment; takes initiative and ownership. Able to balance target audience needs with client needs. Attentive to detail and ability to express creative ideas through web development; work well under the pressure of tight deadlines and changing demands. Able to fully learn and gain a deep understanding of multiple content management/web management tools, and leverage those tools for LLUH web development. Adaptable and able to learn quickly in various technical and creative environments. Able to distinguish colors as necessary; write, hear, read and speak sufficiently for general conversation in person and on the telephone; identify and distinguish various sounds associated with workplace; see adequately to read computer screens and written documents necessary to the position.Licensures and Certifications: Valid Driver's License required at time of hire.Keywords: Acquia Cloud, Drupal, SOLR search, Web DevelopmentAbout UsOur mission is to continue the teaching and healing ministry of Jesus Christ. Our core values are compassion, excellence, humility, integrity, justice, teamwork and wholeness.About the TeamLoma Linda University Health is a Seventh-day Adventist, faith and values based Christian institution. Candidates must understand and embrace the mission, purpose, and identity of Loma Linda and its affiliated entities.We are an equal opportunity employer committed to the principles of diversity. We provide equal opportunities in all aspects of the employment process to every individual, regardless of gender, race, color, age, national origin, ancestry, physical or mental disability, marital or veteran status, genetic information or any other characteristic protected by law. In addition, we will provide reasonable accommodations for otherwise qualified individuals requesting an accommodation due to a disability. If you need accommodation assistance with accessing our job listings or completing an application, or during any other phase of employment with us, please contact Human Resources Management at (909) 651-4001.Loma Linda University Shared Services is a religiously-qualified Equal Opportunity Employer under Title VII of Civil Rights Act of 1964. No question on this application is asked for the purpose of unlawfully limiting or excluding any applicant's consideration for employment because of race, color, religion, gender, age, national origin, disability, genetic information, or any other status protected by applicable law. If you need a reasonable accommodation in the hiring process, please notify Human Resource Management.We appreciate your interest in Loma Linda and wish you success in your job search!",
          "image":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNPJwhQ0rgD2vsMk4lzzyp3uWEzhM7la9gOVMv&s=0",
          "location":"Loma Linda, CA",
          "employmentType":"Full-time",
          "datePosted":"5 days ago",
          "salaryRange":"",
          "jobProviders":[
             {
                "jobProvider":"Media Bistro",
                "url":"https://www.mediabistro.com/jobs/571986455-web-developer-job-at-loma-linda-university-health-in-loma-linda?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             },
             {
                "jobProvider":"Adzuna",
                "url":"https://www.adzuna.com/details/4970409056?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
             }
          ]
       }
    ]
   
 }